denote/20221027T234844--workspace__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-05-20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>大事なことにフォーカスする</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css'><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">大事なことにフォーカスする</h1>

<div id="outline-container-orgb15eb99" class="outline-2">
<h2 id="orgb15eb99"><a href="#orgb15eb99">生産性へのこだわりは功績と逆相関である可能性</a></h2>
<div class="outline-text-2" id="text-orgb15eb99">
<p>
成した仕事の大きさと、仕事場は無関係に見える。
</p>

<p>
最近RedHatの開発者のPCまわりを紹介している動画を見た。多くの開発者は質素なものだった。乱雑な人、片付いている人は半々くらい。片付いているいっても普通の生活のレベルでいう「片付いている」で、モデルルームのようではない。1枚のディスプレイを使う開発者が半分で、残り半分は複数のディスプレイを使う。自分の観測できる範囲のすごい開発者も、ノートパソコン1台という人はけっこういる。使用マシンもそう高性能ではない、年式の経ったものが多い。
</p>

<p>
以前読んだ本で、偉大な作品を残した芸術家や作家の特徴となる習慣を探る、というのがあった。仕事をする場所(ソファやベッド、冷蔵庫の上で仕事する作家もいた)や、昼型/夜型、乱雑/整然について調査していた。結局人によってバラバラで、「成功要因」みたいなものはない、ということだった。開発者についても、同じ結論がいえるように見えた。
</p>

<p>
逆に、二流三流ほど要因や方法にこだわりたがるんじゃないかって、自分と重ねて感じている。PC周りを紹介しているブロガーやプログラマーはネットに多くいるので彼らを何人か観察してみる。自分の仕事環境に自信を持っていて、紹介しているように見える。それぞれのこだわりのグッズや家具があって、画像を多く含んだレビューを入れている。彼らは自分と同じように、職業人として大した特徴のない平凡な人々に見える。
</p>

<ul class="org-ul">
<li>HHKB</li>
<li>複数のディスプレイ</li>
<li>高級チェア</li>
<li>Mac</li>
<li>ディスプレイライト</li>
</ul>

<p>
は、驚くほど出てくる。<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
デスク周りへのこだわりはプログラマとしての能力と逆相関に見える。本当は好きじゃないから少しでも快適にすることでなんとかしようとしているんじゃないか。だから、もし机周りを買い換えて <b>生産性</b> を上げよう、とよく考えるなら注意したほうがいい。コンピュータやソフトウェアそのものに興味がないってことを示している可能性がある。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
単にみんながいいっていう理由で選ばれているように見える。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
